# CanDisconnectLevel Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultistoryStairs..::..CanDisconnectLevel Method
MultistoryStairs Class See Also
---
Checks if the given level can be disconnected from multistory stairs. You cannot disconnect the levels of standard stair (the stair associated with the Reference Level for the multistory stairs) or already disconnected.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool CanDisconnectLevel(
	ElementId levelId
)
```

Visual Basic
---
```text
Public Function CanDisconnectLevel ( _
	levelId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool CanDisconnectLevel(
	ElementId^ levelId
)
```

# ### Parameters
levelId
    Type: Autodesk.Revit.DB..::..ElementId The id of the level.
# ### Return Value
True if the level id can be used to remove stairs.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
MultistoryStairs Class
Autodesk.Revit.DB.Architecture Namespace